IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
    /* Check if setting is valid */
    if (((ulChBit != 0) && ((ADC_COMMON(pxADC)->CCR.w & ulChBit) == 0))
        /* Software is allowed to change common parameters only when all ADCs
         * of the common group are disabled */
        &&  (ADC_REG_BIT(pxADC, CR, ADEN) == 0)
#if (ADC_COUNT > 1)
         && (ADC_PAIR(pxADC)->CR.b.ADEN == 0)
#endif
             )
    {
        SET_BIT(ADC_COMMON(pxADC)->CCR.w, ulChBit);

        if (ucChannel == ADC1_TEMPSENSOR_CHANNEL)
        {
            /* wait temperature sensor stabilization */
            XPD_vDelay_us(ADC_TEMPSENSOR_DELAY_US);
        }
    }
}

/* Stops the further conversions of the selected types */
static void ADC_prvStopConversion(ADC_HandleType * pxADC, uint32_t ulConvFlag)
{
    uint32_t ulTimeout = ADC_STOP_CONVERSION_TIMEOUT;

    /* Verification if ADC is not already stopped */
    if ((pxADC->Inst->CR.w & ADC_STARTCTRL) != 0)
    {
        /* In auto-injection mode, regular group stop ADC_CR_ADSTP is used (not 
         * injected group stop ADC_CR_JADSTP) */
        if ((pxADC->Inst->CFGR.w & (ADC_CFGR_JAUTO | ADC_CFGR_CONT | ADC_CFGR_AUTDLY))
                               == (ADC_CFGR_JAUTO | ADC_CFGR_CONT | ADC_CFGR_AUTDLY))
        {
            uint32_t ulCntr;

            /* Use stop of regular group */
            ulConvFlag = ADC_CR_ADSTART;

            /* Wait until JEOS=1 (maximum Timeout: 4 injected conversions) */
            for (ulCntr = 0; ulCntr < (ADC_CONVERSION_TIME_MAX_CPU_CYCLES * 4); ulCntr++)
            {
                if (ADC_FLAG_STATUS(pxADC, JEOS) == 0)
                {
                    break;
                }
            }

            /* Clear JEOS */
            ADC_FLAG_CLEAR(pxADC, JEOS);
        }

        /* Stop potential conversion on going on regular group */
        if (ulConvFlag != ADC_CR_JADSTART)
        {
            /* Software is allowed to set ADSTP only when ADSTART=1 and ADDIS=0 */
            if ((pxADC->Inst->CR.w & (ADC_CR_ADSTART | ADC_CR_ADDIS)) == ADC_CR_ADSTART)
            {
                /* Stop conversions on regular group */
                ADC_REG_BIT(pxADC, CR, ADSTP) = 1;
            }
        }

        /* Stop potential conversion on going on injected group */
        if (ulConvFlag != ADC_CR_ADSTART)
        {
            /* Software is allowed to set JADSTP only when JADSTART=1 and ADDIS=0 */
            if ((pxADC->Inst->CR.w & (ADC_CR_JADSTART | ADC_CR_ADDIS)) == ADC_CR_JADSTART)
            {
                /* Stop conversions on injected group */
                ADC_REG_BIT(pxADC, CR, JADSTP) = 1;
            }
        }

        /* Wait for conversion effectively stopped */
        XPD_eWaitForMatch(&pxADC->Inst->CR.w, ulConvFlag, 0, &ulTimeout);
    }
}

/* Attempts to set the offset configuration of the input channel list */
static void ADC_prvOffsetConfig(ADC_HandleType * pxADC,
        const ADC_ChannelInitType   axChannels[],
        uint8_t                     ucChannelCount)
{
    union {
        struct {
            __IO uint32_t OFFSET : 12;
                 uint32_t __RESERVED0 : 14;
            __IO uint32_t OFFSET_CH : 5;
            __IO uint32_t OFFSET_EN : 1;
        } b;
        __IO uint32_t w;
    } *pxOFR;
    uint32_t ulUsedChMask = 0, ulOffsetChMask = 0;
    uint8_t i;

    /* Collect offset related information from list */
    for (i = 0; i < ucChannelCount; i++)
    {
        SET_BIT(ulUsedChMask, axChannels[i].Number);
        if (axChannels[i].Offset > 0)
        {
            SET_BIT(ulOffsetChMask, axChannels[i].Number);
        }
    }

    /* If there are channels that don't need offset, but are previously configured */
    ulUsedChMask = pxADC->OffsetUsage & ulUsedChMask & (~ulOffsetChMask);
    if (ulUsedChMask != 0)
    {
        /* Find the channels in the offsets, clear config */
        for (pxOFR = (void*)&pxADC->Inst->OFR1.w;
             (void*)pxOFR <= (void*)&pxADC->Inst->OFR4.w; pxOFR++)
        {
            uint32_t ulChFlag = 1 << pxOFR->b.OFFSET_CH;
            if ((ulUsedChMask & ulChFlag) != 0)
            {
                pxOFR->w = 0;
                CLEAR_BIT(pxADC->OffsetUsage, ulChFlag);
            }
        }
    }
    /* Iterate until all desired offsets are set */
    for (i = 0; i < ucChannelCount; i++)
    {
        /* If the current channel needs an offset */
        if (axChannels[i].Offset > 0)
        {
            /* For the channels that are missing offset */
            for (pxOFR = (void*)&pxADC->Inst->OFR1.w;
                 (void*)pxOFR <= (void*)&pxADC->Inst->OFR4.w; pxOFR++)
            {
                /* If the offset register is disabled, or already used by this channel */
                if ((pxOFR->w == 0) || ((ulOffsetChMask & (1 << pxOFR->b.OFFSET_CH)) != 0))
                {
                    pxOFR->b.OFFSET    = axChannels[i].Offset;
                    pxOFR->b.OFFSET_CH = axChannels[i].Number;
                    pxOFR->b.OFFSET_EN = 1;
                    SET_BIT(pxADC->OffsetUsage, axChannels[i].Number);
                }
            }
        }
        /* All offsets are configured */
        if (pxADC->OffsetUsage == ulOffsetChMask) { break; }
    }
}

/* Common (regular-injected) channel configuration includes:
 *  - Sample Time
 *  - Watchdogs channel selection
 *  - Channel offsets
 *  - Differential mode
 *  - Internal channels activation */
static uint8_t ADC_prvCommonChannelConfig(
        ADC_HandleType *            pxADC,
        const ADC_ChannelInitType   axChannels[],
        uint8_t                     ucChannelCount)
{
    uint8_t ucAWD1Chs = 0;

    /* No ongoing conversions bound settings */
    if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        uint8_t i;
        uint32_t aulWatchdogMasks[4] = {0, 0, 0, 0};

        /* Channel sampling time configuration */
        for (i = 0; i < ucChannelCount; i++)
        {
            /* Sample time configuration */
            ADC_prvSampleTimeConfig(pxADC, &axChannels[i]);

            /* Temporarily holds the current channel flag */
            aulWatchdogMasks[1] = 1 << axChannels[i].Number;

            /* Holds all channels' flags */
            aulWatchdogMasks[0] |= aulWatchdogMasks[1];

