IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
            /* If a watchdog is used for the channel, set it in the configuration */
            if (axChannels[i].Watchdog == ADC_AWD1)
            {
                pxADC->Inst->CFGR.b.AWD1CH = axChannels[i].Number;
                ucAWD1Chs++;
            }
            /* Store channel flag for channel-wise watchdog configuration */
            else if (axChannels[i].Watchdog != ADC_AWD_NONE)
            {
                aulWatchdogMasks[axChannels[i].Watchdog] |= aulWatchdogMasks[1];
            }
        }

        /* Clear unmonitored channel flags, set monitored ones */
        MODIFY_REG(pxADC->Inst->AWD2CR.w, aulWatchdogMasks[0], aulWatchdogMasks[2]);
        MODIFY_REG(pxADC->Inst->AWD3CR.w, aulWatchdogMasks[0], aulWatchdogMasks[3]);

        /* Set offsets configuration */
        ADC_prvOffsetConfig(pxADC, axChannels, ucChannelCount);

        /* ADC disabled */
        if (ADC_REG_BIT(pxADC, CR, ADEN) == 0)
        {
            /* Channel sampling time configuration */
            for (i = 0; i < ucChannelCount; i++)
            {
                /* Internal channel configuration (if applicable) */
                ADC_prvInitInternalChannel(pxADC, axChannels[i].Number);

                /* Configuration of differential mode */
                if (axChannels[i].Differential == ENABLE)
                {
                    ADC_ChannelInitType xDiffPair = axChannels[i];

                    /* Enable differential mode */
                    SET_BIT(pxADC->Inst->DIFSEL.w, 1 << axChannels[i].Number);

                    /* Pair channel sampling time configuration */
                    xDiffPair.Number++;
                    ADC_prvSampleTimeConfig(pxADC, &xDiffPair);
                }
                else
                {
                    /* Disable differential mode (default mode: single-ended) */
                    CLEAR_BIT(pxADC->Inst->DIFSEL.w, 1 << axChannels[i].Number);
                }
            }
        }
    }
    return ucAWD1Chs;
}

/** @addtogroup ADC_Core_Exported_Functions
 * @{ */

/**
 * @brief Initializes the ADC peripheral using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param pxConfig: pointer to ADC setup configuration
 */
void ADC_vInit(ADC_HandleType * pxADC, const ADC_InitType * pxConfig)
{
    /* enable clock */
    ADC_prvClockEnable(pxADC);

    /* Initialize ADC API internal variables */
    pxADC->InjectedConfig = 0;
    pxADC->ConversionCount = 0;
    pxADC->OffsetUsage = 0;

    /* Set used EndFlag */
    if (pxConfig->EndFlagSelection == ADC_EOC_SEQUENCE)
    {
        pxADC->EndFlagSelection = ADC_ENDFLAG_SEQUENCE;
    }
    else
    {
        pxADC->EndFlagSelection = ADC_ENDFLAG_CONVERSION;
    }

    /* Enable voltage regulator (if disabled at this step) */
    if (pxADC->Inst->CR.b.ADVREGEN != 1)
    {
        /* ADC voltage regulator enable sequence */
#ifdef ADC_CR_ADVREGEN_1
        pxADC->Inst->CR.b.ADVREGEN = 0;
#endif
        pxADC->Inst->CR.b.ADVREGEN = 1;

        /* Delay for ADC stabilization time */
        XPD_vDelay_us(ADC_STAB_DELAY_US);
    }

    /* ADC regular conversion stopped */
    if (ADC_REG_BIT(pxADC, CR, ADSTART) == 0)
    {
        ADC_REG_BIT(pxADC, CFGR, CONT)  = pxConfig->ContinuousMode;
        ADC_REG_BIT(pxADC, CFGR, ALIGN) = pxConfig->LeftAlignment;
        pxADC->Inst->CFGR.b.RES         = pxConfig->Resolution;

        /* external trigger configuration */
        if(pxConfig->Trigger.Source == ADC_TRIGGER_SOFTWARE)
        {
            /* reset the external trigger */
            CLEAR_BIT(pxADC->Inst->CFGR.w, ADC_CFGR_EXTSEL | ADC_CFGR_EXTEN);
        }
        else
        {
            /* select external trigger and polarity to start conversion */
            pxADC->Inst->CFGR.b.EXTSEL = pxConfig->Trigger.Source;
            pxADC->Inst->CFGR.b.EXTEN  = pxConfig->Trigger.Edge;
        }

        /* Enable discontinuous mode only if continuous mode is disabled */
        if ((pxConfig->DiscontinuousCount != 0) && (pxConfig->ContinuousMode == DISABLE))
        {
            ADC_REG_BIT(pxADC, CFGR, DISCEN) = 1;
            pxADC->Inst->CFGR.b.DISCNUM = pxConfig->DiscontinuousCount - 1;
        }
        else
        {
            CLEAR_BIT(pxADC->Inst->CFGR.w, ADC_CFGR_DISCEN | ADC_CFGR_DISCNUM);
        }

        /* No injected or regular conversion ongoing */
        if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
        {
            ADC_REG_BIT(pxADC, CFGR, AUTDLY) = pxConfig->LPAutoWait;
            ADC_REG_BIT(pxADC, CFGR, DMACFG) = pxConfig->ContinuousDMARequests;
        }

        /* Set conversion count as flag when scan mode is selected */
        pxADC->ConversionCount = pxConfig->ScanMode & 1;
    }

    /* dependencies initialization */
    XPD_SAFE_CALLBACK(pxADC->Callbacks.DepInit, pxADC);
}

/**
 * @brief Deinitializes the ADC peripheral.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vDeinit(ADC_HandleType * pxADC)
{
    /* Stop potential conversion on going, on regular and injected groups */
    ADC_prvStopConversion(pxADC, ADC_STARTCTRL);

    /* Enable injected queue sequencer after injected conversion stop */
    ADC_REG_BIT(pxADC, CFGR, JQM) = 1;

    /* Disable the ADC peripheral */
    ADC_prvDisableInst(pxADC->Inst);

    /* Reset register IER */
    pxADC->Inst->IER.w = 0;

    /* Reset register ISR */
    pxADC->Inst->ISR.w = ~0;

    /* Reset OFR registers */
    pxADC->Inst->OFR1.w = 0;
    pxADC->Inst->OFR2.w = 0;
    pxADC->Inst->OFR3.w = 0;
    pxADC->Inst->OFR4.w = 0;

    /* Disable voltage regulator */
    CLEAR_BIT(pxADC->Inst->CR.w, ADC_CR_ADVREGEN | ADC_CR_ADCALDIF);
#ifdef ADC_CR_ADVREGEN_1
    SET_BIT(pxADC->Inst->CR.w, ADC_CR_ADVREGEN_1);
#endif

    /* Reset register CFGR */
    pxADC->Inst->CFGR.w = 0;

    /* Deinitialize peripheral dependencies */
    XPD_SAFE_CALLBACK(pxADC->Callbacks.DepDeinit, pxADC);

    /* disable clock */
    ADC_prvClockDisable(pxADC);
}

/**
 * @brief Initializes the regular ADC channels for conversion using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param axChannels: ADC regular channel configuration array pointer
 * @param ucChannelCount: number of channels to configure
 */
void ADC_vChannelConfig(
        ADC_HandleType *            pxADC,
        const ADC_ChannelInitType   axChannels[],
        uint8_t                     ucChannelCount)
{
    /* No regular conversion ongoing */
    if (ADC_REG_BIT(pxADC, CR, ADSTART) == 0)
    {
        uint8_t i, ucAWD1Chs = 0;
        uint32_t aulWatchdogMasks[4] = {0, 0, 0, 0};
        uint32_t ulSeqOffset = ADC_SQR1_SQ1_Pos;
        __IO uint32_t *pulSQR = &pxADC->Inst->SQR1.w;

