IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
        /* Sequencer configuration */
        for (i = 0; i < ucChannelCount; i++)
        {
            MODIFY_REG(*pulSQR, ADC_SQR_MASK << ulSeqOffset,
                    axChannels[i].Number << ulSeqOffset);

            /* Advance to next sequence element */
            ulSeqOffset += ADC_SQR_SIZE;

            /* Jump to next register when the current one is filled */
            if (ulSeqOffset > (32 - ADC_SQR_SIZE))
            {
                pulSQR += ADC_SQR_REGDIR;
                ulSeqOffset = 0;
            }
        }

        /* Forward to channel common configurator */
        ucAWD1Chs = ADC_prvCommonChannelConfig(pxADC, axChannels, ucChannelCount);

        /* Configuration of AWD1 */
        if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
        {
            uint32_t ulClrMask = ADC_CFGR_AWD1SGL;
            uint32_t ulSetMask = 0;

            if (ucAWD1Chs == 0)
            {
                ulClrMask = ADC_CFGR_AWD1EN | ADC_CFGR_AWD1SGL;
            }
            else
            {
                ulSetMask = ADC_CFGR_AWD1EN;

                if (ucAWD1Chs == 1)
                {
                    /* In case of a single channel, set SGL flag
                     * AWD1CH is set in common configurator */
                    ulSetMask = ADC_CFGR_AWD1EN | ADC_CFGR_AWD1SGL;
                }

                /* Disable other group's watchdog if it targeted a single channel */
                if ((pxADC->Inst->CFGR.w & (ADC_CFGR_AWD1SGL | ADC_CFGR_JAWD1EN)) ==
                                           (ADC_CFGR_AWD1SGL | ADC_CFGR_JAWD1EN))
                {
                    ulClrMask = ADC_CFGR_JAWD1EN;
                }
            }
            pxADC->Inst->CFGR.w = (pxADC->Inst->CFGR.w & (~ulClrMask)) | ulSetMask;
        }

        /* Init() sets this variable as flag to indicate ScanMode */
        if (pxADC->ConversionCount > 0)
        {
            pxADC->ConversionCount = ucChannelCount;

            /* Set number of ranks in regular group sequencer */
            pxADC->Inst->SQR1.b.L = pxADC->ConversionCount - 1;
        }
        else
        {
            pxADC->Inst->SQR1.b.L = 0;
        }
    }
}

/**
 * @brief Enables the ADC peripheral and starts conversion if the trigger is software.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStart(ADC_HandleType * pxADC)
{
    /* Success if not started */
    if (ADC_REG_BIT(pxADC, CR, ADSTART) == 0)
    {
        /* ADC turn ON */
        if (ADC_prvEnableInst(pxADC->Inst))
        {
            /* Wait until ADRDY flag is set ( < 1us) */
            uint32_t ulTimeout = 1;
            XPD_eWaitForMatch(&pxADC->Inst->ISR.w, ADC_ISR_ADRDY, ADC_ISR_ADRDY, &ulTimeout);
        }

        /* clear regular group conversion flag and overrun flag */
        SET_BIT(pxADC->Inst->ISR.w, ADC_ISR_EOC | ADC_ISR_EOS | ADC_ISR_OVR);

        /* if ADC is either not in multimode, or the multimode master,
         * enable software conversion of regular channels */
        if (    (ADC_COMMON(pxADC)->CCR.b.DUAL == ADC_MULTIMODE_SINGE)
             || (IS_ADC_MULTIMODE_MASTER_INSTANCE(pxADC->Inst)))
        {
            ADC_REG_BIT(pxADC, CR, ADSTART) = 1;
        }

#if defined(__XPD_ADC_ERROR_DETECT) || defined(__XPD_DMA_ERROR_DETECT)
        pxADC->Errors = ADC_ERROR_NONE;
#endif
    }
}

/**
 * @brief Stops the ADC peripheral.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStop(ADC_HandleType * pxADC)
{
    uint32_t ulTimeout = 1;

    /* 1. Stop potential ongoing conversions */
    ADC_prvStopConversion(pxADC, ADC_STARTCTRL);

    ADC_prvDisableInst(pxADC->Inst);

    XPD_eWaitForMatch(&pxADC->Inst->ISR.w, ADC_ISR_ADRDY, 0, &ulTimeout);
}

/**
 * @brief Polls the status of the ADC operation(s).
 * @param pxADC: pointer to the ADC handle structure
 * @param eOperation: the type of operation to check
 * @param ulTimeout: the timeout in ms for the polling.
 * @return ERROR if there was an input error, TIMEOUT if timed out, OK if successful
 */
XPD_ReturnType ADC_ePollStatus(
        ADC_HandleType *    pxADC,
        ADC_OperationType   eOperation,
        uint32_t            ulTimeout)
{
    XPD_ReturnType eResult = XPD_OK;

    if ((eOperation == ADC_OPERATION_CONVERSION)
            && ((pxADC->EndFlagSelection & ADC_IER_EOSIE) != 0))
    {
        eOperation = ADC_ISR_EOS;
    }
    else if ((eOperation == ADC_OPERATION_INJCONVERSION)
            && ((pxADC->EndFlagSelection & ADC_IER_JEOSIE) != 0))
    {
        eOperation = ADC_ISR_JEOS;
    }

    /* Polling for single conversion is not allowed when DMA is used,
     * and EOC is raised on end of single conversion */
    if (eOperation == ADC_OPERATION_CONVERSION)
    {
        /* If multimode used, check common DMA config, otherwise dedicated DMA config */
        if (ADC_COMMON_REG_BIT(pxADC, CCR, DUAL) == 0)
        {
            if (ADC_REG_BIT(pxADC, CFGR, DMAEN) == 1)
            { eResult = XPD_ERROR; }
        }
        else
        {
            if (ADC_COMMON_REG_BIT(pxADC, CCR, MDMA) == 1)
            { eResult = XPD_ERROR; }
        }
    }

    if (eResult == XPD_OK)
    {
        /* Wait until operation flag is set */
        eResult = XPD_eWaitForMatch(&pxADC->Inst->ISR.w, eOperation, eOperation, &ulTimeout);

        /* Clear end of conversion flag of regular group if low power feature
         * "LowPowerAutoWait " is disabled, to not interfere with this feature
         * until data register is read. */
        if ((eResult == XPD_OK) && ((eOperation & (ADC_ISR_EOC | ADC_ISR_EOS)) != 0)
             && (ADC_REG_BIT(pxADC, CFGR, AUTDLY) == 0))
        {
            SET_BIT(pxADC->Inst->ISR.w, eOperation);
        }
    }
    return eResult;
}

/**
 * @brief Enables the ADC peripheral and interrupts, and starts conversion
 *        if the trigger is software.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStart_IT(ADC_HandleType * pxADC)
{
    /* Choose interrupt source based on EOC config */
    uint32_t ulITs = pxADC->EndFlagSelection;

#ifdef __XPD_ADC_ERROR_DETECT
    /* ADC overrun and end of conversion interrupt for regular group */
    ulITs |= ADC_IER_OVRIE;
#endif

    MODIFY_REG(pxADC->Inst->IER.w, (ADC_IER_EOCIE | ADC_IER_EOSIE | ADC_IER_OVRIE), ulITs);

    ADC_vStart(pxADC);
}

/**
 * @brief Stops the ADC peripheral and disables interrupts.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStop_IT(ADC_HandleType * pxADC)
{
    ADC_vStop(pxADC);

    /* ADC end of conversion interrupt for regular and injected group */
    CLEAR_BIT(pxADC->Inst->IER.w, pxADC->EndFlagSelection | ADC_IER_OVRIE);
}

/**
 * @brief ADC interrupt handler that provides handle callbacks.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vIRQHandler(ADC_HandleType * pxADC)
{
    uint32_t ulISR = pxADC->Inst->ISR.w;
    uint32_t ulIER = pxADC->Inst->IER.w;
    uint32_t ulDual = ADC_COMMON(pxADC)->CCR.b.DUAL;

    /* End of conversion flag for regular channels */
    if (    ((ulISR & (ADC_ISR_EOC | ADC_ISR_EOS)) != 0)
         && ((ulIER & (ADC_IER_EOCIE | ADC_IER_EOSIE)) != 0))
    {
        uint32_t ulCFGR = ADC_prvGetMultiCfgr(pxADC, ulDual);

