IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
        /* If the conversion is not continuous / external triggered */
        if ((ulCFGR & (ADC_CFGR_CONT | ADC_CFGR_EXTEN)) == 0)
        {
            /* End of sequence */
            if (((ulISR & ADC_ISR_EOS) != 0) && (ADC_REG_BIT(pxADC, CR, ADSTART) == 0))
            {
                /* Disable the ADC end of conversion interrupt for regular group */
                CLEAR_BIT(pxADC->Inst->IER.w, ADC_IER_EOCIE | ADC_IER_EOSIE);
            }
        }

        /* Clear the ADC flag for regular end of conversion */
        SET_BIT(pxADC->Inst->ISR.w, ADC_ISR_EOC | ADC_ISR_EOS);

        /* Conversion complete callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.ConvComplete, pxADC);
    }

    /* End of conversion flag for injected channels */
    if (    ((ulISR & (ADC_ISR_JEOC | ADC_ISR_JEOS)) != 0)
         && ((ulIER & (ADC_IER_JEOCIE | ADC_IER_JEOSIE)) != 0))
    {
        uint32_t ulCFGR = ADC_prvGetMultiCfgr(pxADC, ulDual);

        /* Injected conversion is not continuous or not automatic,
         * and software triggered */
        if (    (pxADC->Inst->JSQR.b.JEXTEN == 0)
             || (    ((ulCFGR & ADC_CFGR_CONT) == 0)
                  && (pxADC->Inst->CFGR.b.EXTEN == 0)
                  && (pxADC->Inst->CFGR.b.JAUTO == 0)))
        {
            /* End of sequence */
            if ((ulISR & ADC_ISR_JEOS) != 0)
            {
                if (    (ulDual == ADC_MULTIMODE_SINGE)
                     || (ulDual == ADC_MULTIMODE_DUAL_REGSIMULT)
                     || (ulDual == ADC_MULTIMODE_DUAL_INTERLEAVED)
                     || (IS_ADC_MULTIMODE_MASTER_INSTANCE(pxADC->Inst)))
                {
                    ulCFGR = pxADC->Inst->CFGR.w;
                }
                else
                {
                    ulCFGR = ADC_PAIR(pxADC)->CFGR.w;
                }

                if ((ulCFGR & ADC_CFGR_JQM) == 0)
                {
                    if (ADC_REG_BIT(pxADC, CR, JADSTART) == 0)
                    {
                        /* disable the ADC end of conversion interrupt
                         * for injected group */
                        CLEAR_BIT(pxADC->Inst->IER.w, ADC_IER_JEOC | ADC_IER_JEOS);
                    }
                }
            }
        }
        /* clear the ADC flag for injected end of conversion */
        SET_BIT(pxADC->Inst->ISR.w, ADC_ISR_JEOC | ADC_ISR_JEOS);

        /* injected conversion complete callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.InjConvComplete, pxADC);
    }

    /* Check analog watchdog flag */
    if (    ((ulISR & ADC_ISR_AWD1) != 0)
         && ((ulIER & ADC_IER_AWD1IE) != 0))
    {
        pxADC->ActiveWatchdog = ADC_AWD1;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.Watchdog, pxADC);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        ADC_FLAG_CLEAR(pxADC, AWD1);
    }
    if (    ((ulISR & ADC_ISR_AWD2) != 0)
         && ((ulIER & ADC_IER_AWD2IE) != 0))
    {
        pxADC->ActiveWatchdog = ADC_AWD2;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.Watchdog, pxADC);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        ADC_FLAG_CLEAR(pxADC, AWD2);
    }
    if (    ((ulISR & ADC_ISR_AWD3) != 0)
         && ((ulIER & ADC_IER_AWD3IE) != 0))
    {
        pxADC->ActiveWatchdog = ADC_AWD3;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.Watchdog, pxADC);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        ADC_FLAG_CLEAR(pxADC, AWD3);
    }

#ifdef __XPD_ADC_ERROR_DETECT
    /* Check Overrun flag */
    if (    ((ulISR & ADC_ISR_OVR) != 0)
         && ((ulIER & ADC_IER_OVRIE) != 0))
    {
        /* Update error code */
        pxADC->Errors |= ADC_ERROR_OVERRUN;

        /* Clear the Overrun flag */
        ADC_FLAG_CLEAR(pxADC, OVR);
    }
    /* Check Injected Overrun flag */
    if (    ((ulISR & ADC_ISR_JQOVF) != 0)
         && ((ulIER & ADC_IER_JQOVFIE) != 0))
    {
        /* Update error code */
        pxADC->Errors |= ADC_ERROR_JQOVF;

        /* Clear the Overrun flag */
        ADC_FLAG_CLEAR(pxADC, JQOVF);
    }

    if (pxADC->Errors != ADC_ERROR_NONE)
    {
        /* Error callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.Error, pxADC);
    }
#endif
}

/**
 * @brief Sets up and enables a DMA transfer for the ADC regular conversions.
 * @param pxADC: pointer to the ADC handle structure
 * @param pvAddress: memory address to the conversion data storage
 * @return BUSY if the DMA is used by other peripheral, OK otherwise
 */
XPD_ReturnType ADC_eStart_DMA(ADC_HandleType * pxADC, void * pvAddress)
{
    XPD_ReturnType eResult = XPD_ERROR;

    /* If multimode is used, multimode function shall be used */
    if (ADC_COMMON(pxADC)->CCR.b.DUAL == ADC_MULTIMODE_SINGE)
    {
        /* Set up DMA for transfer */
        eResult = DMA_eStart_IT(pxADC->DMA.Conversion,
                (void *)&pxADC->Inst->DR, pvAddress, pxADC->Inst->SQR1.b.L + 1);

        /* If the DMA is currently used, return with error */
        if (eResult == XPD_OK)
        {
            /* Set the callback owner */
            pxADC->DMA.Conversion->Owner = pxADC;

            /* Set the DMA transfer callbacks */
            pxADC->DMA.Conversion->Callbacks.Complete     = ADC_prvDmaConversionRedirect;
#ifdef __XPD_DMA_ERROR_DETECT
            pxADC->DMA.Conversion->Callbacks.Error        = ADC_prvDmaErrorRedirect;
#endif

#ifdef __XPD_ADC_ERROR_DETECT
            /* Enable ADC overrun interrupt */
            ADC_IT_ENABLE(pxADC, OVR);
#endif

            /* Enable ADC DMA mode */
            ADC_REG_BIT(pxADC, CFGR, DMAEN) = 1;

            ADC_vStart(pxADC);
        }
    }

    return eResult;
}

/**
 * @brief Disables the ADC and its DMA transfer.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStop_DMA(ADC_HandleType * pxADC)
{
    /* Disable the Peripheral */
    ADC_vStop(pxADC);

#ifdef __XPD_ADC_ERROR_DETECT
    /* Disable ADC overrun interrupt */
    ADC_IT_DISABLE(pxADC, OVR);
#endif
    /* Disable the selected ADC DMA mode */
    ADC_REG_BIT(pxADC, CFGR, DMAEN) = 0;

    /* Disable the ADC DMA Stream */
    DMA_vStop_IT(pxADC->DMA.Conversion);
}

/**
 * @brief Initializes the analog watchdog using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param eWatchdog: the analog watchdog selection
 * @param usLowThd: low threshold of the watchdog
 * @param usHighThd: high threshold of the watchdog
 */
void ADC_vWatchdogConfig(
        ADC_HandleType *    pxADC,
        ADC_WatchdogType    eWatchdog,
        uint16_t            usLowThd,
        uint16_t            usHighThd)
{
    /* Configure when ADC is stopped */
    if ((eWatchdog != ADC_AWD_NONE) && ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0))
    {
        uint32_t ulScaling   = pxADC->Inst->CFGR.b.RES * 2;
        __IO uint32_t *pulTR = (&pxADC->Inst->TR1.w + eWatchdog - ADC_AWD1);

        /* Analog watchdogs configuration */
        if (eWatchdog == ADC_AWD1)
        {
            /* Shift the offset in function of the selected ADC resolution:
             * Thresholds have to be left-aligned on bit 11, the LSB (right bits)
             * are set to 0 */
            *pulTR = (usHighThd  << (16 + ulScaling)) | (usLowThd  << ulScaling);
        }
        else
        {
            /* Shift the threshold in function of the selected ADC resolution
             * have to be left-aligned on bit 7, the LSB (right bits) are set to 0 */
            if (ulScaling < 5)
            {
                *pulTR = (usHighThd  << (20 - ulScaling)) | (usLowThd  << (4 - ulScaling));
            }
            else
            {
                *pulTR = (usHighThd  << (20 - ulScaling)) | (usLowThd  >> (ulScaling - 4));
            }
        }
    }
}

/**
 * @brief Returns the currently active analog watchdog.
 * @param pxADC: pointer to the ADC handle structure
 * @return The watchdog number if an active watchdog triggered an interrupt, 0 otherwise
 */
ADC_WatchdogType ADC_eWatchdogStatus(ADC_HandleType * pxADC)
{
    /* Update the active watchdog variable with current flag status */
    pxADC->ActiveWatchdog *= pxADC->Inst->ISR.w >> (pxADC->ActiveWatchdog + ADC_ISR_AWD1_Pos - 1);
    return pxADC->ActiveWatchdog;
}

/** @} */

/** @} */

/** @addtogroup ADC_Injected
 * @{ */

/** @defgroup ADC_Injected_Exported_Functions ADC Injected Exported Functions
 * @{ */

/**
 * @brief Initializes a injected ADC channel for conversion using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param pxConfig: pointer to ADC injected channel setup configuration
 */
void ADC_vInjectedInit(ADC_HandleType * pxADC, const ADC_InjectedInitType * pxConfig)
{
    /* Save trigger configuration into context queue */
    if (pxConfig->Trigger.InjSource != ADC_INJTRIGGER_SOFTWARE)
    {
        pxADC->InjectedConfig =
                (pxConfig->Trigger.InjSource << ADC_JSQR_JEXTSEL_Pos) |
                (pxConfig->Trigger.Edge      << ADC_JSQR_JEXTEN_Pos);
    }
    else
    {
        pxADC->InjectedConfig = 0;
    }

    /* Set configuration that is restricted to no ongoing injected conversions */
    if (ADC_REG_BIT(pxADC, CR, JADSTART) == 0)
    {
        pxADC->Inst->CFGR.b.JQM     = pxConfig->ContextQueue;
        pxADC->Inst->CFGR.b.JDISCEN = pxConfig->DiscontinuousMode & (!pxConfig->AutoInjection);

        /* Set configuration that is restricted to no ongoing conversions */
        if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
        {
            /* Auto-injection is triggered by end of regular group conversion,
             * external triggers are not allowed */
            {
                pxADC->Inst->CFGR.b.JAUTO = pxConfig->AutoInjection;
            }
        }
    }
}

/**
 * @brief Initializes the injected ADC channels for conversion using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param axChannels: ADC injected channel configuration array pointer
 * @param ucChannelCount: number of channels to configure
 */
void ADC_vInjectedChannelConfig(
        ADC_HandleType *            pxADC,
        const ADC_ChannelInitType   axChannels[],
        uint8_t                     ucChannelCount)
{
    uint8_t i, ucAWD1Chs;
    uint32_t ulSeqOffset = ADC_JSQR_JSQ1_Pos, ulJSQR = 0;

    /* Forward to channel common configurator */
    ucAWD1Chs = ADC_prvCommonChannelConfig(pxADC, axChannels, ucChannelCount);

    /* Configuration of AWD1 */
    if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        uint32_t ulClrMask = ADC_CFGR_AWD1SGL;
        uint32_t ulSetMask = 0;

