IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
        if (ucAWD1Chs == 0)
        {
            ulClrMask = ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1SGL;
        }
        else
        {
            ulSetMask = ADC_CFGR_JAWD1EN;

            if (ucAWD1Chs == 1)
            {
                /* In case of a single channel, set SGL flag
                 * AWD1CH is set in common configurator */
                ulSetMask = ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1SGL;
            }

            /* Disable other group's watchdog if it targeted a single channel */
            if ((pxADC->Inst->CFGR.w & (ADC_CFGR_AWD1SGL | ADC_CFGR_AWD1EN)) ==
                                       (ADC_CFGR_AWD1SGL | ADC_CFGR_AWD1EN))
            {
                ulClrMask = ADC_CFGR_AWD1EN;
            }
        }
        pxADC->Inst->CFGR.w = (pxADC->Inst->CFGR.w & (~ulClrMask)) | ulSetMask;
    }

    /* Assemble injected sequence */
    for (i = 0; i < ucChannelCount; i++)
    {
        /* Channel configuration for a given rank */
        MODIFY_REG(ulJSQR, ADC_SQR_MASK << ulSeqOffset, axChannels[i].Number << ulSeqOffset);

        ulSeqOffset += ADC_SQR_SIZE;
    }

    /* Set the injected sequence length */
    MODIFY_REG(ulJSQR, ADC_JSQR_JL, (ucChannelCount - 1) << ADC_JSQR_JL_Pos);

    /* Finally apply the injected setup to the register */
    pxADC->Inst->JSQR.w = ulJSQR | pxADC->InjectedConfig;
}

/**
 * @brief Enables the ADC peripheral and starts injected conversion
 *        if the trigger is software.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vInjectedStart(ADC_HandleType * pxADC)
{
    uint32_t ulDual = ADC_COMMON(pxADC)->CCR.b.DUAL;

    /* Check if ADC peripheral is disabled in order to enable it and wait during
     Tstab time the ADC's stabilization */
    if (ADC_REG_BIT(pxADC,CR,JADSTART) == 0)
    {
        /* Enable the Peripheral */
        if (ADC_prvEnableInst(pxADC->Inst))
        {
            /* Delay for ADC stabilization time */
            XPD_vDelay_us(ADC_STAB_DELAY_US);
        }
    }

    /* clear injected group conversion flag */
    SET_BIT(pxADC->Inst->ISR.w, ADC_ISR_JEOC | ADC_ISR_JEOS | ADC_ISR_JQOVF);

    /* if no external trigger present and ADC is either not in multimode,
     * or the multimode master, enable software conversion of injected channels */
    if ((pxADC->Inst->CFGR.b.JAUTO == 0) &&
        (   (ulDual == ADC_MULTIMODE_SINGE)
         || (ulDual == ADC_MULTIMODE_DUAL_REGSIMULT)
         || (ulDual == ADC_MULTIMODE_DUAL_INTERLEAVED)
         || (IS_ADC_MULTIMODE_MASTER_INSTANCE(pxADC->Inst))))
    {
        ADC_REG_BIT(pxADC,CR,JADSTART) = 1;
    }
}

/**
 * @brief Stop the conversion of injected channels by disabling ADC peripheral.
 * @note  If auto-injection is used, the conversion can only be stopped along with the regular group.
 * @note  In multimode configuration, the master ADC shall be stopped first.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vInjectedStop(ADC_HandleType * pxADC)
{
    /* Stop conversion on injected group only */
    ADC_prvStopConversion(pxADC, ADC_CR_JADSTART);

    /* Disable ADC peripheral if injected conversions are effectively stopped */
    if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        ADC_prvDisableInst(pxADC->Inst);
    }
}

/**
 * @brief Enables the ADC peripheral and interrupts, and starts injected conversion
 *        if the trigger is software.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vInjectedStart_IT(ADC_HandleType * pxADC)
{
    uint32_t ulITs = pxADC->EndFlagSelection & (ADC_IER_JEOCIE | ADC_IER_JEOSIE);
    /* ADC overrun and end of conversion interrupt for regular group */
#ifdef __XPD_ADC_ERROR_DETECT
    ulITs |= ADC_IER_JQOVFIE;
#endif
    SET_BIT(pxADC->Inst->IER.w, ulITs);

    ADC_vInjectedStart(pxADC);
}

/**
 * @brief Stop the conversion of injected channels by disabling ADC peripheral and interrupts.
 * @note  If auto-injection is used, the conversion can only be stopped along with the regular group.
 * @note  In multimode configuration, the master ADC shall be stopped first.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vInjectedStop_IT(ADC_HandleType * pxADC)
{
    ADC_vInjectedStop(pxADC);

    CLEAR_BIT(pxADC->Inst->IER.w, ADC_IER_JEOCIE | ADC_IER_JEOSIE | ADC_IER_JQOVFIE);
}

/** @} */

/** @} */

#ifdef ADC12_COMMON
/** @addtogroup ADC_MultiMode
 * @{ */

/** @defgroup ADC_MultiMode_Exported_Functions Multi ADC Mode Exported Functions
 * @{ */

/**
 * @brief Initializes a multi ADC configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param pxConfig: pointer to the multi ADC setup configuration
 */
void ADC_vMultiModeInit(ADC_HandleType * pxADC, const ADC_MultiModeInitType * pxConfig)
{
    __IO uint32_t * pulCR = &ADC_PAIR(pxADC)->CR.w;
    ADC_Common_TypeDef *pxCommon = ADC_COMMON(pxADC);

    /* Neither ADC should be running regular conversion */
    if (    ((pxADC->Inst->CR.w & ADC_CR_ADSTART) == 0)
         && ((           *pulCR & ADC_CR_ADSTART) == 0))
    {
        pxCommon->CCR.b.MDMA = pxConfig->DMAAccessMode;
        pxCommon->CCR.b.DMACFG = pxADC->Inst->CFGR.b.DMACFG;

        /* Neither ADC should be on */
        if (    ((pxADC->Inst->CR.w & ADC_CR_ADEN) == 0)
             && ((           *pulCR & ADC_CR_ADEN) == 0))
        {
            pxCommon->CCR.b.DUAL  = pxConfig->Mode;
            pxCommon->CCR.b.DELAY = pxConfig->InterSamplingDelay - 1;
        }
    }
}

/**
 * @brief Sets up and enables a DMA transfer for the multi ADC regular conversions.
 * @param pxADC: pointer to the ADC handle structure
 * @param pvAddress: memory address to the conversion data storage
 * @return BUSY if the DMA is used by other peripheral, OK otherwise
 */
XPD_ReturnType ADC_eMultiModeStart_DMA(ADC_HandleType * pxADC, void * pvAddress)
{
    XPD_ReturnType eResult = XPD_ERROR;

    /* Perform ADC enable and conversion start if no conversion is on going
     * (check on ADC master only) */
    if ((ADC_REG_BIT(pxADC,CR,ADSTART) == 0) && ((ADC_INDEX(pxADC) & 1) == 0))
    {
        /* enable both ADCs */
        ADC_prvEnableInst(pxADC->Inst);
        ADC_prvEnableInst(ADC_PAIR(pxADC));

        /* Set up DMA for transfer */
        eResult = DMA_eStart_IT(pxADC->DMA.Conversion,
                (void *)&ADC_COMMON(pxADC)->CDR.w, pvAddress, pxADC->Inst->SQR1.b.L + 1);

        /* If the DMA is currently used, return with error */
        if (eResult == XPD_OK)
        {
            /* Set the callback owner */
            pxADC->DMA.Conversion->Owner = pxADC;

            /* Set the DMA transfer callbacks */
            pxADC->DMA.Conversion->Callbacks.Complete     = ADC_prvDmaConversionRedirect;
#ifdef __XPD_DMA_ERROR_DETECT
            pxADC->DMA.Conversion->Callbacks.Error        = ADC_prvDmaErrorRedirect;
#endif

#ifdef __XPD_ADC_ERROR_DETECT
            /* Enable ADC overrun interrupt */
            ADC_IT_ENABLE(pxADC, OVR);
#endif

            /* Enable the ADC peripherals: master and slave
             * (in case if not already enabled previously) */
            ADC_PAIR(pxADC)->CR.b.ADEN = 1;

